{
  "backend/main.mo": "Motoko backend managing user profiles and per‑user investment portfolios with authentication and CRUD operations for investments.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend features to source files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend files used in the project.",
  "frontend/index.css": "Global Tailwind and theme variable definitions configuring light/dark color palettes and layout base styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, layout, authentication gating, profile setup, and page mounting for the React frontend.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog for destructive actions with loading state support.",
  "frontend/src/components/InvestmentForm.tsx": "Form dialog for creating and editing investments with validation, type selection, and integration with backend hooks.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for entering and saving a user's name with validation and mutation handling.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with authenticated/unauthenticated links, account dropdown, and logout handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useDashboardSummary.ts": "Computes totals and per‑type investment summaries from the investment list.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context providing Internet Identity login, logout, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and investment records via the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme variables with finance‑styled color palette.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Displays a dashboard with investment summaries, loading state, and prompts to add investments when empty.",
  "frontend/src/pages/Home.tsx": "Landing page with hero and feature sections promoting portfolio management and navigation to login or dashboard.",
  "frontend/src/pages/Investment.tsx": "Lists and manages investments with add, edit, delete actions and includes a form and confirmation dialog.",
  "frontend/src/pages/Login.tsx": "Handles Internet Identity authentication, showing login or account details and navigation options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and content paths.",
  "project_state.json": "Defines project state, required images, and a list of existing frontend and feature requirements for a portfolio and investment tracking app. Includes metadata such as schema version, project version, and feature descriptions."
}